Point Load can't have all force components and moment components to be zero.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId PointLoadAllZero { get; }
  Visual Basic
Public Shared ReadOnly Property PointLoadAllZero As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ PointLoadAllZero {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures LoadFailures Class
  Autodesk.Revit.DB Namespace